src/cf/Enums/РолиСчетовЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>РолиСчетовЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СебестоимостьПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КалькуляцияСебестоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КосвенныеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправленческиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходыНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КалькуляцияСтоимостиРемонтовОС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/РолиСчетовЗатрат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет роль счета по умолчанию.
//
// Параметры:
//  Счет - ПланСчетовСсылка.Хозрасчетный
// 
// Возвращаемое значение:
//  Перечисление.РолиСчетовЗатрат
//
Функция ОсновнаяРольСчета(Счет) Экспорт
	
	ОсновныеРоли = ОсновныеРолиСчетов();
	
	Возврат ЗначениеРоли(Счет, ОсновныеРоли);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеРоли(Счет, ОсновныеРоли)
	
	Роль = ОсновныеРоли[Счет];
	Если ЗначениеЗаполнено(Роль) Тогда
		Возврат Роль;
	КонецЕсли;
	
	ГруппаСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "Родитель");
	Если ЗначениеЗаполнено(ГруппаСчета) Тогда
		Возврат ЗначениеРоли(ГруппаСчета, ОсновныеРоли);
	КонецЕсли;
	
	Возврат ОсновныеРоли[ПланыСчетов.Хозрасчетный.ПустаяСсылка()];
	
КонецФункции

Функция ОсновныеРолиСчетов()
	
	РолиСчетов = Новый Соответствие;
	
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство_,        КалькуляцияСебестоимости);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства_, КалькуляцияСебестоимости);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ВыполнениеРемонтовОС,         КалькуляцияСтоимостиРемонтовОС);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы,  КосвенныеЗатраты);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы,     УправленческиеРасходы);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.РасходыНаПродажу,             РасходыНаПродажу);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.БракВПроизводстве,            СебестоимостьПродаж);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства,    ПрочиеРасходы);
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ВыпускПродукции,              ВыпускПродукции);
	
	РолиСчетов.Вставить(ПланыСчетов.Хозрасчетный.ПустаяСсылка(),               СебестоимостьПродаж); // Остальные счета
	
	Возврат РолиСчетов;
	
КонецФункции

#КонецОбласти


#КонецЕсли
